# Rebar Free Form Creation Result Class

Source: https://www.revitapidocs.com/2026/26f4b416-214d-845d-dbb7-9bb481397fd4.htm

---

| Rebar Free Form Creation Result Class |
| --- |

Class that encapsulates the result of the rebar free form creation. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Structure RebarFreeFormCreationResult

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class RebarFreeFormCreationResult : IDisposable
```

```
Public Class RebarFreeFormCreationResult
	Implements IDisposable
```

```
public ref class RebarFreeFormCreationResult : IDisposable
```

```
type RebarFreeFormCreationResult =
    class
        interface IDisposable
    end
```
The RebarFreeFormCreationResult type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | Error | Identifies the error that occurs during the operation. Will be Success if everything is ok, otherwise the failure reason. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Rebar | Identifies the created Rebar. If the error code is Success, then it will be a valid rebar, otherwise it will be a Rebar. |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarFreeFormCreationResult |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

Autodesk.Revit.DB.Structure Namespace